<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"Staging","backend":"a472f96dd92b2e9277dafd73d665b05ad97a79762d8597c58ed3c4747f77a204","plan_job_ref":"Job Staging Environment #60 at https://github.com/IrezD/cloud-s3-website-with-cicd-pipeline-v2.0/actions/runs/7240652259","plan_hash":"20dcd78bdd4ab8b5681ed47c2bc38e573ea0bf3c111d1fa9d45ad9798bd83ef2","plan_text_format":"text","version":"1.38.0","closed":true} -->
Terraform plan for __Staging__
<details>
<summary>Plan: 0 to add, 7 to change, 1 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
  - destroy
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.site-iam-policy will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "site-iam-policy" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
              + "s3:ListBucket",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:s3:::dev-portfolio-website-2.0",
              + "arn:aws:s3:::dev-portfolio-website-2.0/*",
            ]
          + sid       = "Allowing Cloudfront to access private S3 Bucket"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "arn:aws:cloudfront::806066816337:distribution/EOUIG3G6N7CQQ",
                ]
              + variable = "AWS:SourceArn"
            }

          + principals {
              + identifiers = [
                  + "cloudfront.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # aws_acm_certificate.site-cert will be updated in-place
  ~ resource "aws_acm_certificate" "site-cert" {
        id                        = "arn:aws:acm:us-east-1:806066816337:certificate/8083d8c6-b35d-4e50-9b47-6a5b5db8417c"
      ~ tags                      = {
          - "Name" = "Staging Environment" -> null
        }
      ~ tags_all                  = {
          + "Environment" = "Dev Environment"
          - "Name"        = "Staging Environment" -> null
        }
        # (14 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_cloudfront_distribution.s3_distribution will be updated in-place
  ~ resource "aws_cloudfront_distribution" "s3_distribution" {
      ~ comment                        = "Distribution for my Staging Environment" -> "Distribution for my dev"
        id                             = "EOUIG3G6N7CQQ"
      ~ tags                           = {
          - "Environment" = "Staging Environment" -> null
        }
      ~ tags_all                       = {
          ~ "Environment" = "Staging Environment" -> "Dev Environment"
        }
        # (18 unchanged attributes hidden)

      ~ viewer_certificate {
          ~ cloudfront_default_certificate = false -> true
            # (3 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # aws_cloudfront_origin_access_control.cloudfront-OAC will be updated in-place
  ~ resource "aws_cloudfront_origin_access_control" "cloudfront-OAC" {
      ~ description                       = "Staging Environment Policy" -> "dev Policy"
        id                                = "E2CRU248JYT3ZY"
        name                              = "my dev orign access control"
        # (4 unchanged attributes hidden)
    }

  # aws_dynamodb_table.tfstate-dynamodb-table will be destroyed
  # (because aws_dynamodb_table.tfstate-dynamodb-table is not in configuration)
  - resource "aws_dynamodb_table" "tfstate-dynamodb-table" {
      - arn                         = "arn:aws:dynamodb:eu-central-1:806066816337:table/tfstate-portfolio-dev" -> null
      - billing_mode                = "PAY_PER_REQUEST" -> null
      - deletion_protection_enabled = false -> null
      - hash_key                    = "LockID" -> null
      - id                          = "tfstate-portfolio-dev" -> null
      - name                        = "tfstate-portfolio-dev" -> null
      - read_capacity               = 0 -> null
      - stream_enabled              = false -> null
      - table_class                 = "STANDARD" -> null
      - tags                        = {
          - "Name" = "Staging Environment"
        } -> null
      - tags_all                    = {
          - "Name" = "Staging Environment"
        } -> null
      - write_capacity              = 0 -> null

      - attribute {
          - name = "LockID" -> null
          - type = "S" -> null
        }

      - point_in_time_recovery {
          - enabled = false -> null
        }

      - ttl {
          - enabled = false -> null
        }
    }

  # aws_s3_bucket.site-bucket will be updated in-place
  ~ resource "aws_s3_bucket" "site-bucket" {
        id                          = "dev-portfolio-website-2.0"
      ~ tags                        = {
          - "Environment" = "Staging Environment" -> null
        }
      ~ tags_all                    = {
          ~ "Environment" = "Staging Environment" -> "Dev Environment"
        }
        # (12 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_s3_bucket_policy.site-bucket-policy will be updated in-place
  ~ resource "aws_s3_bucket_policy" "site-bucket-policy" {
        id     = "dev-portfolio-website-2.0"
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = [
                          - "s3:ListBucket",
                          - "s3:GetObject",
                        ]
                      - Condition = {
                          - StringEquals = {
                              - "AWS:SourceArn" = "arn:aws:cloudfront::806066816337:distribution/EOUIG3G6N7CQQ"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "cloudfront.amazonaws.com"
                        }
                      - Resource  = [
                          - "arn:aws:s3:::dev-portfolio-website-2.0/*",
                          - "arn:aws:s3:::dev-portfolio-website-2.0",
                        ]
                      - Sid       = "Allowing Cloudfront to access private S3 Bucket"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # aws_s3_object.object will be updated in-place
  ~ resource "aws_s3_object" "object" {
      + acl                    = "private"
      ~ etag                   = "17f6c5843fcc0ce850bc70e24fc6e9e4" -> "88d1c45c89eb9fda8d4c775e122e9d36"
        id                     = "index.html"
        tags                   = {}
      ~ tags_all               = {
          + "Environment" = "Dev Environment"
        }
      ~ version_id             = "********************************" -> (known after apply)
        # (9 unchanged attributes hidden)
    }

  # aws_s3_object.profile-object will be updated in-place
  ~ resource "aws_s3_object" "profile-object" {
      + acl                    = "private"
        id                     = "pic001.jpg"
        tags                   = {}
      ~ tags_all               = {
          + "Environment" = "Dev Environment"
        }
        # (11 unchanged attributes hidden)
    }

Plan: 0 to add, 7 to change, 1 to destroy.
```
</details>

:x: Error applying plan in [Staging Environment #60](https://github.com/IrezD/cloud-s3-website-with-cicd-pipeline-v2.0/actions/runs/7240652259)